Repository: daPhipz/exercise-timer
Catalog: po/*.po
Languages: ru

# shortcut window
source: Training
ru: Тренировка

# shortcut window
source: Start/Stop training
ru: Начать/закончить тренировку

# shortcut window
source: Reset training
ru: Начать заново

# shortcut window
source: General
ru: Общие

# shortcut window
source: Show Shortcuts
ru: Показать горячие клавиши

# shortcut window
source: Quit
ru: Выйти

source: Exercise Timer
ru: Таймер упражнений

source: Timer clock for high intensity interval training
ru: Таймер для интервальных тренировок с высокой интенсивностью

source: Gnome;GTK;Utility;Sports;Exercise;HIIT;Training;Exercise;High intensity interval training;
ru: Gnome;GTK;Utility;Sports;Exercise;HIIT;Training;Exercise;High intensity interval training;Тренировки;Таймер;Спорт;

source: The width of the window
ru: Ширина окна

source: The height of the window
ru: Высота окна

source: If the window is maximized
ru: На весь экран

source: Default training setup, in JSON notation
ru: Упражнение по умолчанию, в формате JSON

source: List of training setups, in JSON notation
ru: Список упражнений, в формате JSON

source: The duration of the warmup, in seconds
ru: Продолжительность разминки, в секундах

source: The volume of the beeping sound
ru: Громкость звукового сигнала

source: Train and rest with high intensity
ru: Выполняй упражнения с высокой интенсивностью

source: Exercise timer is a simple utility to conduct interval training.
ru: Таймер упражнений — простая утилита для проведения интервальных тренировок.

source: Following a short preparation period, a prescribed number of exercise sets are played. In between each exercise, there is a resting period.
ru: После небольшой подготовки выполняется предписанное количество подходов к упражнению. Между каждым упражнением есть период отдыха.

source: The app does not make an assumption about the kind of the exercise.
ru: Приложение не учитывает характер упражнения.

source: Features:
ru: Функции:

source: Save and recall presets containing the number of sets and the duration of the exercise and rest periods.
ru: Сохраняйте и вызывайте предустановки, содержащие количество подходов, продолжительность упражнений и периодов отдыха.

source: Set the duration of the preparation in the settings.
ru: Установите продолжительность подготовки в настройках.

source: A beeping sound is played at- and prior to each transition.
ru: Перед каждым подходом и во время него воспроизводится звуковой сигнал.

source: The volume of the sound can be adjusted.
ru: Громкость звука можно регулировать.

source: Light and dark mode follows the system's setting.
ru: Светлый и темный режим соответствуют настройкам системы.

source: Exercise list - dark mode
ru: Список упражнений - темный режим

source: Timer - dark mode
ru: Таймер - темный режим

source: Exercise list - light mode
ru: Список упражнений - светлый режим

source: Timer - light mode
ru: Таймер - светлый режим

source: _Keyboard Shortcuts
ru: _Горячие клавиши

source: _About Exercise Timer
ru: _О таймере упражнений

source: Training List
ru: Список упражнений

source: Add Training
ru: Добавить упражнение

source: Main Menu
ru: Главное меню

source: No training is created yet
ru: Упражнение пока не создано

source: Create training
ru: Создать упражнение

source: Timer
ru: Таймер

source: translator_credits
ru: Stepan Kashuba

source: New Training
ru: Новое упражнение

source: Edit Training
ru: Изменить упражнение

source: Cancel
ru: Отмена

source: Create
ru: Создать

source: Update
ru: Обновить

source: Name
ru: Название

source: Number of Sets
ru: Количество подходов

source: Rest Time
ru: Время отдыха

source: seconds
ru: секунды

source: Exercise Time
ru: Время упражнения

source: Preparation Time
ru: Время на подготовку

source: Sets
ru: Подходы

source: Exercise
ru: Упражнение

source: {} s
ru: {} с

source: Rest
ru: Отдых

source: Preparation
ru: Подготовка

source: Delete Training
ru: Удалить упражнение

source: Start Training
ru: Начать упражнение

source: Finished!
ru: Закончили!

source: Restart Training
ru: Перезапустить упражнение

source: Pause Training
ru: Приостановить упражнение

source: Resume Training
ru: Продолжить упражнение

source: Set Volume
ru: Настроить громкость

source: Remaining Sets: {}
ru: Осталось подходов: {}

source: Could not decode WAV
ru: Не удалось декодировать WAV

source: Could not play audio
ru: Не удалось воспроизвести аудио

source: Could not open resource data
ru: Не удалось открыть данные ресурса

source: Could not create audio output stream
ru: Не удалось создать выходной аудиопоток

source: Cannot find 'name' in settings dictionary
ru: Не могу найти 'name' в словаре настроек

source: Cannot find 'sets' in settings dictionary
ru: Не могу найти 'sets' в словаре настроек

source: Cannot find 'exercise_s' in settings dictionary
ru: Не могу найти 'exercise_s' в словаре настроек

source: Cannot find 'rest_s' in settings dictionary
ru: Не могу найти 'rest_s' в словаре настроек

source: Could not parse default training setup
ru: Не удалось загрузить упражнение по умолчанию

source: Could not parse exercise list
ru: Не удалось загрузить список упражнений

source: Could not update settings with training list
ru: Не удалось обновить настройки с помощью списка упражнений

source: Could not register resources
ru: Не удалось зарегистрировать ресурсы

source: Unable to bind the text domain
ru: Невозможно привязать текстовый домен

source: Unable to switch to the text domain
ru: Невозможно переключиться на текстовый домен

source: Could not connect to a display
ru: Не удалось подключиться к дисплею

source: Could not build the Help Overlay
ru: Не удалось создать окно справки
